01- how to find the version

In [64]:
import pandas as pd
pd.__version__

'1.5.2'

In [65]:
#another way
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 8dab54d6573f7186ff0c3b6364d5e4dd635ff3e7
python           : 3.10.6.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.22000
machine          : AMD64
processor        : AMD64 Family 23 Model 24 Stepping 1, AuthenticAMD
byteorder        : little
LC_ALL           : None
LANG             : None
LOCALE           : English_United Kingdom.1252

pandas           : 1.5.2
numpy            : 1.23.5
pytz             : 2022.6
dateutil         : 2.8.2
setuptools       : 63.2.0
pip              : 22.3.1
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.1.2
IPython          : 8.6.0
pandas_datareader: None
bs4              : 4.11.1
bottleneck       : None
brotli           : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.6.2
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : 3.0.10
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : None
snappy           : None
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None
tzdata           : None

02- Make a dataframe

In [66]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df.head()

   A  B
0  1  4
1  2  5
2  3  6

In [67]:
#numpy array use to create dataframe
import numpy as np
arr = np.array([[1, 2, 3],[4, 5, 6],[7, 8, 9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [68]:
# to give dataframe coloumn names
pd.DataFrame(arr,columns=['a','b','c'])

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [69]:
# another way to make numpy array dataframe
arr =pd.DataFrame(np.random.rand(5, 5))

In [70]:
# another way to make numpy array dataframe with coloumn name
arr =pd.DataFrame(np.random.rand(5, 5), columns=list('abcde'))
arr

          a         b         c         d         e
0  0.148949  0.306106  0.106876  0.952284  0.297781
1  0.487149  0.455271  0.488871  0.966625  0.541199
2  0.982365  0.748129  0.488147  0.457337  0.606005
3  0.534195  0.083704  0.290268  0.405899  0.227277
4  0.471511  0.006793  0.417784  0.859975  0.621935

03- how to rename the columns?

In [71]:
df = pd.DataFrame({'A_col': [1, 2, 3], 'B_col': [4, 5, 6]})
df

   A_col  B_col
0      1      4
1      2      5
2      3      6

In [72]:
df.rename(columns={"A_col":"col_a", "B_col":"col_b"},inplace = True)
df

   col_a  col_b
0      1      4
1      2      5
2      3      6

In [73]:
# rename columns another way
df.columns = ['a_col', 'b_col']
df

   a_col  b_col
0      1      4
1      2      5
2      3      6

In [74]:
df.columns = df.columns.str.replace('_',' ')
df

   a col  b col
0      1      4
1      2      5
2      3      6

In [75]:
# Adding prefix to column
df = df.add_prefix("shah_")
df

   shah_a col  shah_b col
0           1           4
1           2           5
2           3           6

In [76]:
#adding suffix to the column
df = df.add_suffix("_shah")
df

   shah_a col_shah  shah_b col_shah
0                1                4
1                2                5
2                3                6

In [77]:
df.columns = ["col_a","col_b"]
df

   col_a  col_b
0      1      4
1      2      5
2      3      6

4- Using Template data

In [78]:
import pandas as pd
import numpy as np
import seaborn as sns

Kashti = sns.load_dataset("titanic")
Kashti.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [80]:
kashti.describe()

NameError: name 'kashti' is not defined

In [ ]:
kashti.columns

NameError: name 'kashti' is not defined

In [81]:
#saving the dataset
kashti.to_csv("kashti_save.csv")
kashti.to_excel("kashti_save.xlsm")

NameError: name 'kashti' is not defined

5- Using your own data

In [ ]:
df = pd.read_excel("kashti_save.xlsm")
df.head()

In [ ]:
df = pd.read_csv("kashti_save.csv")
df.head()

6- Reverse Row order

In [ ]:
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
kashti = sns.load_dataset("titanic")
kashti.head()

In [ ]:
kashti.loc[::-1].head()

NameError: name 'kashti' is not defined

In [ ]:
kashti.loc[::-1].reset_index(drop=True).head()

In [ ]:
kashti.loc[::-1].head()

7- reverse the coloumn

In [ ]:
kashti.loc[:,::-1].head()

8-  select column by data type

In [ ]:
kashti.dtypes

In [ ]:
#only select those have numeric type
kashti.select_dtypes(include=['number']).head()

In [ ]:
# only select those have object type
kashti.select_dtypes(include=['object']).head()

In [ ]:
# only select those have object and numbers type
kashti.select_dtypes(include=['object','number']).head()

In [ ]:
#select all except object type
kashti.select_dtypes(exclude=['object']).head()

9- convert string to number

In [ ]:
df = pd.DataFrame({'col_a': [1, 2, 3,4,5,6,7,8,10,20],
 'col_b': ["4", "5", "6","7","8","9","10","11","12","13"],})
df.dtypes

In [ ]:

df.astype({"col_a": "int64", "col_b":"int64"}).dtypes

In [ ]:
df.dtypes

In [ ]:
pd.to_numeric(df["col_a"],errors= "coerce")

10- reduce data size

In [ ]:

kashti = sns.load_dataset('titanic')
kashti.shape

In [ ]:
kashti.sample(frac=0.50)

In [ ]:
kashti.info()

11- copy data from excell and paste it in jupyter notebook

In [ ]:
df = pd.read_clipboard()
df
df.to_csv("excell_data.csv")

12- Split dataset in two equal parts

In [ ]:
import seaborn as sns
import pandas as pd
kashti = sns.load_dataset('titanic')
kashti.shape

In [ ]:
# checking the length of the dataset
len(kashti)

In [ ]:
# checking the raw and column of the dataset
kashti.shape

In [ ]:
# split the dataset in two equal parts
kashti_1 = kashti.sample(frac=0.50)
kashti_1.shape

In [ ]:
# to get the second part of the dataset
kashti_2 = kashti.drop(kashti_1.index)
kashti_2.shape

In [ ]:
kashti_1.head()

In [ ]:
kashti_2.head()

13- Joining two datasets

In [ ]:
kashti_all = kashti_1.append(kashti_2)
kashti_all.shape

In [ ]:
kashti.columns

14- filter dataset

In [ ]:
kashti.sex.unique()

In [ ]:
# if we want data for male only
kashti[(kashti.sex=="male")].head()

In [ ]:
kashti.embark_town.unique()

In [ ]:
kashti[(kashti.embark_town=="Southampton")].head()

In [ ]:
# to get data about male who embarked from Southampton and Queenstown
kashti[((kashti.embark_town=="Southampton")|
        (kashti.embark_town=="Queenstown")) &
        (kashti.sex=="male")]

In [ ]:
# filter using "isin", "equal to", "not in" functions
kashti[kashti.embark_town.isin(["Southampton","Queenstown"])].head()

In [ ]:
# to get data of those age < 30
kashti[kashti.age<30].head()

15- Filtering by large categories

In [ ]:
kashti.embark_town.value_counts()

In [ ]:
kashti.sex.value_counts()

In [ ]:
kashti.age.value_counts()

In [ ]:
# to get the largest under the category
kashti.age.value_counts().nlargest(5)

16- Splitting the string into multiple columns

In [ ]:
# first we create a dataset with two columns
import pandas as pd
df = pd.DataFrame({"name": ['john doe', 'steve smith', 'jane doe'],
                   'location': ['new york, USA', 'california, USA', 'texas, USA'],})
df

In [ ]:
# now we split the name column into two columns
df[["First Name","Last Name"]] = df.name.str.split(" ",expand=True)
df

In [ ]:
# now refine data manupulation
df = df[["First Name","Last Name","location"]]
df

17- Aggregation by multiple groups /functions

In [ ]:
kashti = sns.load_dataset('titanic')
kashti.groupby("sex").count()

In [ ]:
# length function with groupby to check the number of categories
len(kashti.groupby("who"))
kashti

In [ ]:
kashti.groupby(["who", "pclass"]).count()

18- Selecting specific rows and columns

In [ ]:
# first we are selecting the columns  
kashti[["sex","deck","class"]]

In [ ]:
kashti.describe()

In [ ]:
kashti.describe().loc[["min", "max", "mean", "std"]]

In [ ]:
kashti.describe().loc["min":"max"]

In [ ]:
# if we want specific rows and columns
kashti.describe().loc["min":"max","age":"fare"]

19- Reshape multiindex series

In [ ]:
kashti.survived.mean()

In [ ]:
kashti.groupby("sex").survived.mean()

In [ ]:
kashti.groupby(["sex","pclass"]).survived.mean()

20- Continious to Categorical data

In [ ]:
kashti.age.head()

In [ ]:
# creating bins
pd.cut(kashti.age, bins=[0, 18, 24,99 ], labels=["child", "young adult", "adult"])

In [ ]:
#adding the new column using the cut function
kashti["new_age"] = pd.cut(kashti.age, bins=[0, 18, 24,99 ], labels=["child", "young adult", "adult"])
kashti.head()

In [ ]:
# convert one set of values into another
kashti.sex.map({"male": 0, "female": 1})

In [ ]:
#creating a new column using map function
kashti["sex_code"] = kashti.sex.map({"male": 0, "female": 1})
kashti.head()

In [ ]:
kashti["embarked_num"] = kashti.embarked.factorize()[0]
kashti.head(5)

22- Transpose a wide dataframe

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# creating a new dataset
df = pd.DataFrame(np.random.rand(200,25), columns=list('ABCDEFGHIJKLMNOPQRSTUVWXY'))
df

In [ ]:
df.head().T

In [ ]:
df.describe().head()

In [ ]:
df.describe().T.head()

23- Reshaping the dataframe

In [ ]:
fasla = pd.DataFrame([["12345", 100, 200, 300],["34567", 300,400, 500],["67890", 700,800,900]], 
                          columns=["zip", "factory", "warehouse", "retail"])

In [ ]:
fasla

In [ ]:
fasla.T

In [ ]:
fasla_2 = pd.DataFrame([[1,"12345","factory"],[2, "34567", "warehouse"]],columns=["id", "zip", "location"])
fasla_2

In [ ]:
sns.barplot(x="zip", y="factory", data=fasla)

In [ ]:
fasla_long = fasla.melt(id_vars="zip", var_name="location_type", value_name="distance")
fasla_long
# this help us in visualizing the data better

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
sns.barplot(x="zip", y="distance", hue="location_type", data=fasla_long)
plt.show()